load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up"
    - duration: 120  
      arrivalRate: 5
      name: "Gradual ramp up"
    - duration: 60
      arrivalRate: 10
      name: "Peak load"

scenarios:
  - name: "Health check monitoring"
    weight: 30
    flow:
      - get:
          url: "/api/health"
          capture:
            - json: "$.memory.rss"
              as: "memory_rss"
            - json: "$.memory.heapUsed" 
              as: "memory_heap"
      - think: 5

  - name: "Metrics monitoring"
    weight: 20
    flow:
      - get:
          url: "/api/metrics"
          capture:
            - json: "$.memory.rss"
              as: "metrics_memory"
      - think: 3

  - name: "Main app pages"
    weight: 30
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/admin"
      - think: 3

  - name: "WebSocket server health"
    weight: 20
    flow:
      - get:
          url: "http://localhost:3001/health"
          capture:
            - json: "$.connections"
              as: "ws_connections"
            - json: "$.mongodb"
              as: "db_status"
      - think: 5